trunk/bambinome_joel/Services/DivingBookingComp/src/jbiasa/DivingBookingComp.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="DivingBookingComp"
             xmlns:tns="DivingBookingComp" xmlns:ns="http://j2ee.netbeans.org/wsdl/DivingBooking/ScubaDiving" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://j2ee.netbeans.org/wsdl/DivingBooking/SharkDiving" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:ns2="http://j2ee.netbeans.org/wsdl/DivingBooking/TaxiService" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:fi="http://java.sun.com/xml/ns/wsit/2006/09/policy/fastinfoset/service" xmlns:tcp="http://java.sun.com/xml/ns/wsit/2006/09/policy/soaptcp/service" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy">
    <import namespace="http://j2ee.netbeans.org/wsdl/DivingBooking/ScubaDiving" location="../jbiServiceUnits/DivingBooking/ScubaDiving.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/DivingBooking/SharkDiving" location="../jbiServiceUnits/DivingBooking/SharkDiving.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/DivingBooking/TaxiService" location="../jbiServiceUnits/DivingBooking/TaxiService.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:ScubaDivingPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ScubaDivingOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="DivingBookingComp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="DivingBookingComp"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding2" type="ns1:SharkDivingPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="SharkDivingOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="DivingBookingComp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="DivingBookingComp"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding3" type="ns2:TaxiServicePortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="TaxiServiceOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="DivingBookingComp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="DivingBookingComp"/>
            </output>
        </operation>
    </binding>
    <service name="DivingBookingCompService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/DivingBookingCompService1/casaPort1"/>
        </port>
    </service>
    <service name="DivingBookingCompService2">
        <port name="casaPort2" binding="tns:casaBinding2">
            <soap:address location="http://localhost:${HttpDefaultPort}/DivingBookingCompService2/casaPort2"/>
        </port>
    </service>
    <service name="DivingBookingCompService3">
        <port name="casaPort3" binding="tns:casaBinding3">
            <soap:address location="http://localhost:${HttpDefaultPort}/DivingBookingCompService3/casaPort3"/>
        </port>
    </service>
    <wsp:Policy wsu:Id="casaBinding2Policy">
        <wsp:ExactlyOne>
            <wsp:All/>
        </wsp:ExactlyOne>
    </wsp:Policy>
</definitions>



