trunk/bambinome_joel/Services/DivingBookingComp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:div="DivingBookingComp" xmlns:exc="http://xml.netbeans.org/schema/Exchanges">
  <soapenv:Body>
    <div:ScubaDivingOperation>
      <ScubaDivingRequest>
        <exc:guestName>toto</exc:guestName>
        <exc:roomNumber>3</exc:roomNumber>
        <exc:requestDate>2008-09-29</exc:requestDate>
        <exc:numberOfDivers>3</exc:numberOfDivers>
        <exc:lunchInclued>true</exc:lunchInclued>
        <exc:interest>
          <exc:Caves>Caves</exc:Caves>
          <exc:Dolphins>Dolphins</exc:Dolphins>
          <exc:Sharks>Sharks</exc:Sharks>
          <exc:Wrecks>Wrecks</exc:Wrecks>
        </exc:interest>
      </ScubaDivingRequest>
    </div:ScubaDivingOperation>
  </soapenv:Body>
</soapenv:Envelope>